<details ><summary>plan for home 2025-09-11 04:21:50 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # terraform_data.foo will be created
  + resource "terraform_data" "foo" {
      + id     = (known after apply)
      + input  = "test2"
      + output = (known after apply)
    }

  # terraform_data.tskey_stable will be created
  + resource "terraform_data" "tskey_stable" {
      + id     = (known after apply)
      + input  = (sensitive value)
      + output = (known after apply)
    }

  # terraform_data.tskey_stable_replacement_hook will be created
  + resource "terraform_data" "tskey_stable_replacement_hook" {
      + id     = (known after apply)
      + input  = [
          + (known after apply),
        ]
      + output = (known after apply)
    }

  # module.block_storage.proxmox_virtual_environment_vm.block_storage will be created
  + resource "proxmox_virtual_environment_vm" "block_storage" {
      + acpi                    = true
      + bios                    = "seabios"
      + boot_order              = [
          + "ide3",
        ]
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "block-storage"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = false
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = false
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "block-storage",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + cdrom {
          + enabled   = false
          + file_id   = "none"
          + interface = "ide3"
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 10
          + ssd               = false
        }

      + network_device (known after apply)

      + vga (known after apply)
    }

  # module.block_storage.terraform_data.name will be created
  + resource "terraform_data" "name" {
      + id = (known after apply)
    }

  # module.block_storage.time_static.creation_date will be created
  + resource "time_static" "creation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "ovmf"
      + boot_order              = [
          + "scsi0",
        ]
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "debian13"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = false
      + stop_on_destroy         = true
      + tablet_device           = false
      + tags                    = [
          + "terraform",
          + "template",
          + "debian",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 19013

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + efi_disk {
          + datastore_id      = "zssd"
          + file_format       = "raw"
          + pre_enrolled_keys = false
          + type              = "4m"
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.debian13.terraform_data.combined_ci_hash will be created
  + resource "terraform_data" "combined_ci_hash" {
      + id     = (known after apply)
      + input  = {
          + hash = 0
        }
      + output = (known after apply)
    }

  # module.debian13.terraform_data.creation_date will be created
  + resource "terraform_data" "creation_date" {
      + id     = (known after apply)
      + input  = {
          + timestamp = (known after apply)
        }
      + output = (known after apply)
    }

  # module.debian13.time_static.creation_date will be created
  + resource "time_static" "creation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + boot_order              = [
          + "scsi0",
        ]
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "ubuntu22"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = false
      + stop_on_destroy         = true
      + tablet_device           = false
      + tags                    = [
          + "terraform",
          + "template",
          + "ubuntu",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 18022

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.ubuntu22.terraform_data.combined_ci_hash will be created
  + resource "terraform_data" "combined_ci_hash" {
      + id     = (known after apply)
      + input  = {
          + hash = 0
        }
      + output = (known after apply)
    }

  # module.ubuntu22.terraform_data.creation_date will be created
  + resource "terraform_data" "creation_date" {
      + id     = (known after apply)
      + input  = {
          + timestamp = (known after apply)
        }
      + output = (known after apply)
    }

  # module.ubuntu22.time_static.creation_date will be created
  + resource "time_static" "creation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.vm.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = false
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = false
          + node_name = "pve1"
          + retries   = 1
          + vm_id     = (known after apply)
        }

      + cpu {
          + cores      = 4
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 10
          + ssd               = false
        }
      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 10
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.vm.terraform_data.combined_ci_hash will be created
  + resource "terraform_data" "combined_ci_hash" {
      + id     = (known after apply)
      + input  = {
          + hash = (known after apply)
        }
      + output = (known after apply)
    }

  # module.vm.terraform_data.creation_date will be created
  + resource "terraform_data" "creation_date" {
      + id     = (known after apply)
      + input  = {
          + timestamp = (known after apply)
        }
      + output = (known after apply)
    }

  # module.vm.time_static.creation_date will be created
  + resource "time_static" "creation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.vm.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] will be created
  + resource "proxmox_virtual_environment_file" "ci_user_data" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

  # module.vm.module.cloud_init_files[0].random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "combined_ci_hash"                    = (known after apply)
          + "short_ci_meta_data_contents_hash"    = "0"
          + "short_ci_network_data_contents_hash" = "0"
          + "short_ci_user_data_contents_hash"    = (known after apply)
          + "short_ci_vendor_data_contents_hash"  = "0"
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (home)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                        RESOURCE                                         |
|--------|-----------------------------------------------------------------------------------------|
| add    | `module.block_storage.proxmox_virtual_environment_vm.block_storage`                     |
|        | `module.block_storage.terraform_data.name`                                              |
|        | `module.block_storage.time_static.creation_date`                                        |
|        | `module.debian13.proxmox_virtual_environment_vm.vm`                                     |
|        | `module.debian13.terraform_data.combined_ci_hash`                                       |
|        | `module.debian13.terraform_data.creation_date`                                          |
|        | `module.debian13.time_static.creation_date`                                             |
|        | `module.ubuntu22.proxmox_virtual_environment_vm.vm`                                     |
|        | `module.ubuntu22.terraform_data.combined_ci_hash`                                       |
|        | `module.ubuntu22.terraform_data.creation_date`                                          |
|        | `module.ubuntu22.time_static.creation_date`                                             |
|        | `module.vm.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0]` |
|        | `module.vm.module.cloud_init_files[0].random_id.random_id`                              |
|        | `module.vm.proxmox_virtual_environment_vm.vm`                                           |
|        | `module.vm.terraform_data.combined_ci_hash`                                             |
|        | `module.vm.terraform_data.creation_date`                                                |
|        | `module.vm.time_static.creation_date`                                                   |
|        | `tailscale_tailnet_key.tailscale_key`                                                   |
|        | `terraform_data.foo`                                                                    |
|        | `terraform_data.tskey_stable`                                                           |
|        | `terraform_data.tskey_stable_replacement_hook`                                          |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p home
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>